lesson.org

# Main lesson contents file. Course writing happens here. Please edit
# at will

# See [[./handbook.org]] or [[./slides.org]], resp for the handbook
# for students or the slides for presentation in the classroom.

#+TITLE: How to teach using org-mode for fun and profit
#+DESCRIPTION: Olivier Berger's org-mode framework for teaching
#+AUTHOR: Olivier Berger
#+DATE: 2018-04-23



# won't work for the moment
# #+REVEAL_HEAD_PREAMBLE: <style type="text/css">
# #+REVEAL_HEAD_PREAMBLE:<!--/*--><![CDATA[/*><!--*/
# #+REVEAL_HEAD_PREAMBLE: div.figure { float:right; }
# #+REVEAL_HEAD_PREAMBLE: /*]]>*/-->
# #+REVEAL_HEAD_PREAMBLE: </style>


#+REVEAL_HLEVEL: 2
# +REVEAL_THEME: league
#+REVEAL_THEME: simple
# +REVEAL_TRANS: none
#+REVEAL_TRANS: fade
#+REVEAL_SPEED: fast
#+REVEAL_MARGIN: 0.0
#+REVEAL_EXTRA_CSS: ./presentation.css
#+REVEAL_ROOT: ./reveal.js
# +REVEAL_TITLE_SLIDE_BACKGROUND: ./media/title-slide-background.png
#+REVEAL_EXTRA_JS:      { src: './reveal.js-jump-plugin/jump/jump.js', async: true }

# org-reveal options : 
#+OPTIONS: reveal_center:nil 
# + OPTIONS: reveal_title_slide:<h1>%s</h1>

#+OPTIONS: tags:nil ^:nil

#+LANGUAGE: en


#+REVEAL_HEAD_PREAMBLE: <meta name="copyright" content="Teaching with org-mode / org-reveal for fun and profit -- Olivier Berger  -- 2016" />



* Introduction

This is a demo document about the
[[http://www-public.tem-tsp.eu/~berger_o/org-teaching/][codename =org-teaching=]] framework.

* Slides                                                         :slidesonly:
#+ATTR_REVEAL: :frag (appear)
- /You're viewing a [[http://lab.hakim.se/reveal-js/][reveal.js]] Web slides deck. You may press 's' to view presenter notes./

#+BEGIN_NOTES
You'll find the source code at Gitlab : https://gitlab.com/olberger/org-teaching

I mention /codename/ =org-teaching= because it really hasn't yet a proper name, and may never have. This is far from a full fledged product.
#+END_NOTES

* Org-mode powa

This framework heavily relies on [[http://orgmode.org/][org-mode]] (version 9 at the time of writing) and the [[https://github.com/yjwen/org-reveal/][org-reveal]] exporter for =reveal.js=.

* About this slides deck                                         :slidesonly:

These slides are one variant of the same teaching material, also available [[./handbook.pdf][as a handbook]].

You may prefer to view them in your Web browser in full-screen (=F11=
for instance). Should =Reveal-JS= fail on displaying slides, an
alternate format would be the [[./slides.pdf][printed PDF]] (but
you're gonna lose the ability to display speaker notes).

#+BEGIN_NOTES
This section is displayed only in the slides variant, but not in the /handbook/ variant, which contains, in turn, a section that is different.
#+END_NOTES

* About this handbook                                          :handbookonly:

This PDF handbook is one variant of the same teaching material, also
available [[./slides.html][as a slides deck]]. Note that the layout is
formatted as a portrait handbook, including speaker notes.

This section may contain content that is best viewed in (LaTeX) PDF export of org-mode.

* Features
:PROPERTIES:
:REVEAL_EXTRA_ATTR: class="center"
:reveal_background: #dbdbed
:END:

** Writing teaching material in org-mode

The goal is to be able to edit a single file (namely =lesson.org=) which will contain, in a single source, all the content of a lesson, written with org-mode syntax.

From this single source, several documents are generated :
- *slides* (as a dynamic Web document) for overhead presentation
- a *handbook* that contains the same information (or more) and can be
  handed to the _students_ for work outside the classroom (a [[file:handbook.pdf][PDF file]])

#+REVEAL: split

- another *handbook* for the _teaching team_, to provide additional instructions (also a [[file:teacher-handbook.pdf][PDF file]])

#+BEGIN_NOTES
The handbook LaTeX formatting has a summarized content table and nice looking (in principle) title page. Customize at will.

The teachers handbook contains a less nice-looking format, includes a detailed table of contents, and has a watermark. Again, customize at will and submit improvements.
#+END_NOTES

** org-reveal slides

Pretty much all features of =reveal.js= supported by the org-mode reveal.js exporter [[https://github.com/yjwen/org-reveal/][org-reveal]], should be supported too.

An example =org-reveal= document is [[./elisp/org-reveal/Readme.html][available here]] for inspiration (it's the export of org-reveal's =README.org=, actually).

#+BEGIN_NOTES
If you're already familiar with reveal.js, you may have noticed that the current settings adopted for our slides generation are quite frugal: no fancy 3D effects and likes.

It's a matter of taste : I didn't want to show off, and prefer to give students a clear content on the projector behind me.
#+END_NOTES

** Structure of the sections / slides

I'm using the 3 levels of outlining / sectioning so that the content can be sectioned in the same way in =lesson.org= and appear appropriately in the slides and handbook, with these principles:

1. First level outlines define main sections of the document.
2. Second level outlines are the main "horizontal" slides that will be played with page up/down
3. Third level outlines may be used for additional content ("vertical" slides) that may be skipped for the presentation, but is still accessible with cursor keys.

#+BEGIN_NOTES
The first level outlines can be rendered as a "separating" slides which may get a different =reveal_background= and ~class="center"~ slide layout, but that isn't automatic. See [[*Section separators][Section separators]].
#+END_NOTES

