lesson.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2017-05-18 jeu. 16:47 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>How to teach using org-mode for fun and profit</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Olivier Berger" />
<meta name="description" content="Olivier Berger's org-mode framework for teaching"
 />
</head>
<body>
<div id="content">
<h1 class="title">How to teach using org-mode for fun and profit</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org3214cf8">1. Introduction</a>
<ul>
<li><a href="#orga479807">1.1. Org-mode powa</a></li>
</ul>
</li>
<li><a href="#org2b8828c">2. About this slides deck</a></li>
<li><a href="#orgfb32a92">3. About this handbook</a></li>
<li><a href="#org711a958">4. Features</a>
<ul>
<li><a href="#org63bfe1b">4.1. Writing teaching material in org-mode</a></li>
<li><a href="#org572e9e3">4.2. org-reveal slides</a></li>
<li><a href="#orgd54b486">4.3. Structure of the sections / slides</a></li>
<li><a href="#org10815c4">4.4. Presenter notes / content for the handbook</a></li>
<li><a href="#org5b0e47b">4.5. Masking content for some audiences</a></li>
<li><a href="#org35b26b7">4.6. Stuff only meant for presentation</a>
<ul>
<li><a href="#orgb6e7b25">4.6.1. Regular slide (no tag on heading line)</a></li>
<li><a href="#org4e2504d">4.6.2. Only in the slides</a></li>
</ul>
</li>
<li><a href="#orgde64678">4.7. Stuff only meant for teachers</a>
<ul>
<li><a href="#org1783aeb">4.7.1. Regular slide (no tag on heading line)</a></li>
<li><a href="#org7a0025c">4.7.2. Only for teachers</a></li>
</ul>
</li>
<li><a href="#org3d6c98c">4.8. Notes only for the teachers</a></li>
<li><a href="#orgad963fc">4.9. Stuff only in the handbooks</a></li>
<li><a href="#org4f1c8cb">4.10. Code colorization</a></li>
<li><a href="#org5b8a04c">4.11. Misc org-mode</a>
<ul>
<li><a href="#org1ab04f3">4.11.1. Babel powa</a></li>
</ul>
</li>
<li><a href="#orgbe42750">4.12. Missing features ?</a></li>
</ul>
</li>
<li><a href="#org261ffb1">5. HowTo</a>
<ul>
<li><a href="#orgc1206f5">5.1. Use Emacs</a></li>
<li><a href="#orgb9a90d2">5.2. Modify only the lesson.org</a></li>
<li><a href="#org3603f1e">5.3. Configuration</a></li>
<li><a href="#orga8c3f88">5.4. Generating final documents</a>
<ul>
<li><a href="#orgb420c55">5.4.1. Exporting slides to HTML with org-reveal</a></li>
<li><a href="#orgfd16198">5.4.2. Printing slides</a></li>
</ul>
</li>
<li><a href="#org3317770">5.5. Known Issues</a>
<ul>
<li><a href="#org80c5570">5.5.1. Firefox issues ?</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org2e868dd">6. How it works / Installation</a>
<ul>
<li><a href="#org8da4a66">6.1. Use the source Luke</a></li>
<li><a href="#orga11e691">6.2. Git submodules</a></li>
<li><a href="#org8f28f62">6.3. Slides appearance</a>
<ul>
<li><a href="#org1d57a49">6.3.1. Reveal.js settings</a></li>
<li><a href="#org55c05ff">6.3.2. Section separators</a></li>
<li><a href="#org0ba5c0b">6.3.3. Title screen picture (logos, etc.)</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org52b77c7">7. Annex</a>
<ul>
<li><a href="#org5ae2323">7.1. Thanks</a></li>
<li><a href="#orge84a414">7.2. Feedback</a></li>
<li><a href="#org14326fd">7.3. Usage reports</a>
<ul>
<li><a href="#org3a41846">7.3.1. 2016 at Telecom SudParis</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>



<div id="outline-container-org3214cf8" class="outline-2">
<h2 id="org3214cf8"><span class="section-number-2">1</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
<p>
This is a demo document about the
<a href="http://www-public.tem-tsp.eu/~berger_o/org-teaching/">codename <code>org-teaching</code></a> framework.
</p>

<ul class="org-ul">
<li><i>You're viewing a <a href="http://lab.hakim.se/reveal-js/">reveal.js</a> Web slides deck. You may press 's' to view presenter notes.</i></li>
</ul>

<div class="NOTES">
<p>
You'll find the source code at Gitlab : <a href="https://gitlab.com/olberger/org-teaching">https://gitlab.com/olberger/org-teaching</a>
</p>

<p>
I mention <i>codename</i> <code>org-teaching</code> because it really hasn't yet a proper name, and may never have. This is far from a full fledged product.
</p>

</div>
</div>

<div id="outline-container-orga479807" class="outline-3">
<h3 id="orga479807"><span class="section-number-3">1.1</span> Org-mode powa</h3>
<div class="outline-text-3" id="text-1-1">
<p>
This framework heavily relies on <a href="http://orgmode.org/">org-mode</a> (version 9 at the time of writing) and the <a href="https://github.com/yjwen/org-reveal/">org-reveal</a> exporter for <code>reveal.js</code>.
</p>
</div>
</div>
</div>

<div id="outline-container-org2b8828c" class="outline-2">
<h2 id="org2b8828c"><span class="section-number-2">2</span> About this slides deck</h2>
<div class="outline-text-2" id="text-2">
<p>
These slides are one variant of the same teaching material, also available <a href="./handbook.pdf">as a handbook</a>.
</p>

<p>
You may prefer to view them in your Web browser in full-screen (<code>F11</code>
for instance). Should <code>Reveal-JS</code> fail on displaying slides, an
alternate format would be the <a href="./slides.pdf">printed PDF</a> (but
you're gonna lose the ability to display speaker notes).
</p>

<div class="NOTES">
<p>
This section is displayed only in the slides variant, but not in the <i>handbook</i> variant, which contains, in turn, a section that is different.
</p>

</div>
</div>
</div>

<div id="outline-container-orgfb32a92" class="outline-2">
<h2 id="orgfb32a92"><span class="section-number-2">3</span> About this handbook</h2>
<div class="outline-text-2" id="text-3">
<p>
This PDF handbook is one variant of the same teaching material, also
available <a href="./slides.html">as a slides deck</a>. Note that the layout is
formatted as a portrait handbook, including speaker notes.
</p>

<p>
This section may contain content that is best viewed in (LaTeX) PDF export of org-mode.
</p>
</div>
</div>

<div id="outline-container-org711a958" class="outline-2">
<h2 id="org711a958"><span class="section-number-2">4</span> Features</h2>
<div class="outline-text-2" id="text-4">
</div>

<div id="outline-container-org63bfe1b" class="outline-3">
<h3 id="org63bfe1b"><span class="section-number-3">4.1</span> Writing teaching material in org-mode</h3>
<div class="outline-text-3" id="text-4-1">
<p>
The goal is to be able to edit a single file (namely <code>lesson.org</code>) which will contain, in a single source, all the content of a lesson, written with org-mode syntax.
</p>

<p>
From this single source, several documents are generated :
</p>
<ul class="org-ul">
<li><b>slides</b> (as a dynamic Web document) for overhead presentation</li>
<li>a <b>handbook</b> that contains the same information (or more) and can be handed to the students for work outside the classroom (a PDF file)</li>
<li>another <b>handbook</b> for the teaching team, to provide additional instructions (also a PDF file)</li>
</ul>

<div class="NOTES">
<p>
The handbook LaTeX formatting has a summarized content table and nice looking (in principle) title page. Customize at will
</p>

<p>
The teachers handbook contains a less nice-looking format, includes a detailed table of contents, and has a watermark. Again, customize at will and submit improvements.
</p>

</div>
</div>
</div>

<div id="outline-container-org572e9e3" class="outline-3">
<h3 id="org572e9e3"><span class="section-number-3">4.2</span> org-reveal slides</h3>
<div class="outline-text-3" id="text-4-2">
<p>
Pretty much all features of <code>reveal.js</code> supported by the org-mode reveal.js exporter <a href="https://github.com/yjwen/org-reveal/">org-reveal</a>, should be supported too.
</p>

<p>
An example <code>org-reveal</code> document is <a href="./elisp/org-reveal/Readme.html">available here</a> for inspiration (it's the export of org-reveal's <code>README.org</code>, actually).
</p>

<div class="NOTES">
<p>
If you're already familiar with reveal.js, you may have noticed that the current settings adopted for our slides generation are quite frugal: no fancy 3D effects and likes.
</p>

<p>
It's a matter of taste : I didn't want to show off, and prefer to give students a clear content on the projector behind me.
</p>

</div>
</div>
</div>

<div id="outline-container-orgd54b486" class="outline-3">
<h3 id="orgd54b486"><span class="section-number-3">4.3</span> Structure of the sections / slides</h3>
<div class="outline-text-3" id="text-4-3">
<p>
I'm using the 3 levels of outlining / sectioning so that the content can be sectioned in the same way in <code>lesson.org</code> and appear appropriately in the slides and handbook, with these principles:
</p>

<ol class="org-ol">
<li>First level outlines define main sections of the document.</li>
<li>Second level outlines are the main "horizontal" slides that will be played with page up/down</li>
<li>Third level outlines may be used for additional content ("vertical" slides) that may be skipped for the presentation, but is still accessible with cursor keys.</li>
</ol>

<div class="NOTES">
<p>
The first level outlines can be rendered as a "separating" slides which may get a different <code>reveal_background</code> and <code>class="center"</code> slide layout, but that isn't automatic. See <a href="#org55c05ff">Section separators</a>.
</p>

</div>
</div>
</div>
