lesson.org
** Presenter notes / content for the handbook

[[https://github.com/yjwen/org-reveal/#speaker-notes][org-reveal's /Speaker notes/]] may be added to the slides (and will only appear on
dual-screen presentation after having pressed '/s/': standard reveal.js
feature).

They will be masked for the audience, but will, by default appear in the handbook given to the students.

#+BEGIN_SRC org
  ,#+BEGIN_NOTES
  This is a note
  ,#+END_NOTES
#+END_SRC

** Masking content for some audiences

I've implemented some easy ways to preserve some of the content of the same =lesson.org= source for certain outputs (using org exporter's standard =EXCLUDE_TAGS=):

- /Slides only/ material :: that won't be embedded in the handbook : surprise stuff for live audience, or HTML-only hacks;
- /Teachers only/ material :: secret knowledge that only adults need
     to know (for instance), which won't be exported;
#+REVEAL: split
- /Handbook only/ material :: stuff that only fits in the handbook, and/or only exports as LaTeX and not HTML.

#+BEGIN_NOTES
The choice to reveal or not some details to the students is quite arbitrary and depends on your pedagogical approach. I'm not advisable in this matter. YMMV.
#+END_NOTES

** Stuff only meant for presentation

Tagging a section/slide with =:slidesonly:= means it isn't exported in the handbooks.

Below is an example (or not)...

*** Regular slide (no tag on heading line)

There should be no "Only in the slides" after this section, in the
handbooks, as it has been tagged with =slidesonly=.

*** Only in the slides                                         :slidesonly:

On the contrary, in the slides view, this appears, as there's a =:slidesonly:= tag on the current head line.

** Stuff only meant for teachers

Tagging a section/slide with =:teachersonly:= means it isn't exported in the students handbook (nor in the slides).

Below is an example...

*** Regular slide (no tag on heading line)

There should be no "Only for teachers" after this section, in the slides or in the
students handbook, as it has been tagged with =teachersonly=.

*** Only for teachers                                        :teachersonly:

On the contrary this appears in the teachers handbook, as there's a =:teachersonly:= tag on the current head line.

** Notes only for the teachers

This slide/section contains notes, but only part of it is displayed in
the presentation notes included in the handbook. Special notes and are
kept only for the teachers handbook.

We use an org-mode drawer for that (additional benefit is that the content is folded by default in emacs, as it may be verbose and/or "sensitive") :
#+BEGIN_SRC org
  ,#+BEGIN_NOTES
  This part of the note can be viewed by the students in the handbook.

  :TEACHERSONLY:
  Not this one
  :END:
  ,#+END_NOTES
#+END_SRC

#+BEGIN_NOTES

This part of the note can be viewed by the students in the handbook,
but not the rest.

:TEACHERSONLY:
- *TEACHERSONLY* :: but this part is only for the teachers.

You naughty ;-)
:END:

#+END_NOTES

** Stuff only in the handbooks

Just like sections are for slides only, others can be for the handbook
only, using the =handbookonly= tag. This may be useful for *Annex*
sections for instance, or for stuff that the HTML exporter won't like, with inline LaTeX.

** Code colorization
Code is colorized / highlighted in the slides :-)

#+BEGIN_NOTES
Nice when like me, you're teaching Computer Science stuff
#+END_NOTES
** Misc org-mode

*** Babel powa
As you're using org-mode, its =babel= components are available, to embed source code in the same =lesson.org= source, and manage executable code and teaching material at once.

Look for /literate programing/ instructions in the [[http://orgmode.org/manual/Working-with-source-code.html][org-mode docs]] to know more.

*** Jumping to slide number

Included is the use of the
[[https://github.com/SethosII/reveal.js-jump-plugin][reveal.js jump
plugin]] to allow jumping directly to slides # by entering a number
and hitting RETURN. Quite handy while writing and testing slides.

** Missing features ?

Please try and talk to me to suggest new stuff and/or provide patches ;)

#+BEGIN_NOTES
See the teacher's handbook for some ideas

:TEACHERSONLY:
- a way to manage graphics alongside the slides/handbook source... not yet found a perfect solution, unless for plantuml with babel or likes (tikz...).

- some breadcrumb or recap feature / template to help give a sense of
  the progression in the slides : only the progress bar isn't enough
  and doesn't help giving the audience some kind of scaffolding to
  hang on, for long presentations.

:END:
#+END_NOTES

* HowTo
:PROPERTIES:
:REVEAL_EXTRA_ATTR: class="center"
:reveal_background: #dbdbed
:END:

** Use Emacs

There's no production chain, makefiles or other authoring tools. 

No new Elisp either.

#+BEGIN_NOTES
You're welcome to suggest improvements. But I'm not an Elisp hacker,
so I may not be able to maintain them. At the moment, the intent is to
rely on the original org-reveal only, as much as possible.
#+END_NOTES

** Modify only the lesson.org

*Only one file should be edited for writing the lesson's material : =lesson.org=*

Only exception is modification of some configurations for title pages
and other bits that shouldn't change much in time (see next section).

** Configuration

Each =lesson.org= needs some configuration :
- Configure =org-reveal-title-slide= in =slides.org=.

- Configure in the headers elements like:
  - /header/ (=\lhead{...}= and =\rhead{...}=)
  - and /footer/ (=\lfoot{...}= and =\rfoot{...}=) 

  ex: =#+LaTeX_HEADER: \rhead{...}= in =handbook.org= and
    =teacher-handbook.org=.

#+BEGIN_NOTES
These may be better handled, but some limitations of the exporters or
my lack of knowledge/time have prevented a better result so
far. Improvements much welcome.
#+END_NOTES

