lesson.html

<div id="outline-container-org10815c4" class="outline-3">
<h3 id="org10815c4"><span class="section-number-3">4.4</span> Presenter notes / content for the handbook</h3>
<div class="outline-text-3" id="text-4-4">
<p>
<a href="https://github.com/yjwen/org-reveal/#speaker-notes">org-reveal's <i>Speaker notes</i></a> may be added to the slides (and will only appear on dual-screen presentation after having pressed 's': standard reveal.js feature).
</p>

<p>
They will be masked for the audience, but will, by default appear in the handbook given to the students.
</p>

<div class="org-src-container">
<pre class="src src-org"><span style="color: #b22222;">#+BEGIN_NOTES</span>
This is a note
<span style="color: #b22222;">#+END_NOTES</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org5b0e47b" class="outline-3">
<h3 id="org5b0e47b"><span class="section-number-3">4.5</span> Masking content for some audiences</h3>
<div class="outline-text-3" id="text-4-5">
<p>
I've implemented some easy ways to preserve some of the content of the same <code>lesson.org</code> source for certain outputs (using org exporter's standard <code>EXCLUDE_TAGS</code>):
</p>

<dl class="org-dl">
<dt><i>Slides only</i> material</dt><dd>that won't be embedded in the handbook : surprise stuff for live audience, or HTML-only hacks;</dd>
<dt><i>Teachers only</i> material</dt><dd>secret knowledge that only adults need to know (for instance), which won't be exported;</dd>
<dt><i>Handbook only</i> material</dt><dd>stuff that only fits in the handbook, and/or only exports as LaTeX and not HTML.</dd>
</dl>

<div class="NOTES">
<p>
The choice to reveal or not some details to the students is quite arbitrary and depends on your pedagogical approach. I'm not advisable in this matter. YMMV.
</p>

</div>
</div>
</div>

<div id="outline-container-org35b26b7" class="outline-3">
<h3 id="org35b26b7"><span class="section-number-3">4.6</span> Stuff only meant for presentation</h3>
<div class="outline-text-3" id="text-4-6">
<p>
Tagging a section/slide with <code>:slidesonly:</code> means it isn't exported in the handbooks.
</p>

<p>
Below is an example (or not)&#x2026;
</p>
</div>

<div id="outline-container-orgb6e7b25" class="outline-4">
<h4 id="orgb6e7b25"><span class="section-number-4">4.6.1</span> Regular slide (no tag on heading line)</h4>
<div class="outline-text-4" id="text-4-6-1">
<p>
There should be no "Only in the slides" after this section, in the
handbooks, as it has been tagged with <code>slidesonly</code>.
</p>
</div>
</div>

<div id="outline-container-org4e2504d" class="outline-4">
<h4 id="org4e2504d"><span class="section-number-4">4.6.2</span> Only in the slides</h4>
<div class="outline-text-4" id="text-4-6-2">
<p>
On the contrary, in the slides view, this appears, as there's a <code>:slidesonly:</code> tag on the current head line.
</p>
</div>
</div>
</div>

<div id="outline-container-orgde64678" class="outline-3">
<h3 id="orgde64678"><span class="section-number-3">4.7</span> Stuff only meant for teachers</h3>
<div class="outline-text-3" id="text-4-7">
<p>
Tagging a section/slide with <code>:teachersonly:</code> means it isn't exported in the students handbook (nor in the slides).
</p>

<p>
Below is an example&#x2026;
</p>
</div>

<div id="outline-container-org1783aeb" class="outline-4">
<h4 id="org1783aeb"><span class="section-number-4">4.7.1</span> Regular slide (no tag on heading line)</h4>
<div class="outline-text-4" id="text-4-7-1">
<p>
There should be no "Only for teachers" after this section, in the slides or in the
students handbook, as it has been tagged with <code>teachersonly</code>.
</p>
</div>
</div>

<div id="outline-container-org7a0025c" class="outline-4">
<h4 id="org7a0025c"><span class="section-number-4">4.7.2</span> Only for teachers</h4>
<div class="outline-text-4" id="text-4-7-2">
<p>
On the contrary this appears in the teachers handbook, as there's a <code>:teachersonly:</code> tag on the current head line.
</p>
</div>
</div>
</div>

<div id="outline-container-org3d6c98c" class="outline-3">
<h3 id="org3d6c98c"><span class="section-number-3">4.8</span> Notes only for the teachers</h3>
<div class="outline-text-3" id="text-4-8">
<p>
This slide/section contains notes, but only part of it is displayed in
the presentation notes included in the handbook. Special notes and are
kept only for the teachers handbook.
</p>

<p>
We use an org-mode drawer for that (additional benefit is that the content is folded by default in emacs, as it may be verbose and/or "sensitive") :
</p>
<div class="org-src-container">
<pre class="src src-org"><span style="color: #b22222;">#+BEGIN_NOTES</span>
This part of the note can be viewed by the students in the handbook.

<span style="color: #a020f0;">:TEACHERSONLY:</span>
Not this one
<span style="color: #a020f0;">:END:</span>
<span style="color: #b22222;">#+END_NOTES</span>
</pre>
</div>

<div class="NOTES">
<p>

</p>

<p>
This part of the note can be viewed by the students in the handbook,
but not the rest.
</p>

<dl class="org-dl">
<dt><b>TEACHERSONLY</b></dt><dd>but this part is only for the teachers.</dd>
</dl>

<p>
You naughty ;-)
</p>

</div>
</div>
</div>

<div id="outline-container-orgad963fc" class="outline-3">
<h3 id="orgad963fc"><span class="section-number-3">4.9</span> Stuff only in the handbooks</h3>
<div class="outline-text-3" id="text-4-9">
<p>
Just like sections are for slides only, others can be for the handbook
only, using the <code>handbookonly</code> tag. This may be useful for <b>Annex</b>
sections for instance, or for stuff that the HTML exporter won't like, with inline LaTeX.
</p>
</div>
</div>

<div id="outline-container-org4f1c8cb" class="outline-3">
<h3 id="org4f1c8cb"><span class="section-number-3">4.10</span> Code colorization</h3>
<div class="outline-text-3" id="text-4-10">
<p>
Code is colorized / highlighted in the slides :-)
</p>

<div class="NOTES">
<p>
Nice when like me, you're teaching Computer Science stuff
</p>

</div>
</div>
</div>
<div id="outline-container-org5b8a04c" class="outline-3">
<h3 id="org5b8a04c"><span class="section-number-3">4.11</span> Misc org-mode</h3>
<div class="outline-text-3" id="text-4-11">
</div><div id="outline-container-org1ab04f3" class="outline-4">
<h4 id="org1ab04f3"><span class="section-number-4">4.11.1</span> Babel powa</h4>
<div class="outline-text-4" id="text-4-11-1">
<p>
As you're using org-mode, its <code>babel</code> components are available, to embed source code in the same <code>lesson.org</code> source, and manage executable code and teaching material at once.
</p>

<p>
Look for <i>literate programing</i> instructions in the <a href="http://orgmode.org/manual/Working-with-source-code.html">org-mode docs</a> to know more.
</p>
</div>
</div>
</div>

<div id="outline-container-orgbe42750" class="outline-3">
<h3 id="orgbe42750"><span class="section-number-3">4.12</span> Missing features ?</h3>
<div class="outline-text-3" id="text-4-12">
<p>
Please try and talk to me to suggest new stuff and/or provide patches ;)
</p>

<div class="NOTES">
<p>
See the teacher's handbook for some ideas
</p>

<ul class="org-ul">
<li>a way to manage graphics alongside the slides/handbook source&#x2026; not yet found a perfect solution, unless for plantuml with babel or likes (tikz&#x2026;).</li>

<li>some breadcrumb or recap feature / template to help give a sense of
the progression in the slides : only the progress bar isn't enough
and doesn't help giving the audience some kind of scaffolding to
hang on, for long presentations.</li>
</ul>

</div>
</div>
</div>
</div>

<div id="outline-container-org261ffb1" class="outline-2">
<h2 id="org261ffb1"><span class="section-number-2">5</span> HowTo</h2>
<div class="outline-text-2" id="text-5">
</div>

<div id="outline-container-orgc1206f5" class="outline-3">
<h3 id="orgc1206f5"><span class="section-number-3">5.1</span> Use Emacs</h3>
<div class="outline-text-3" id="text-5-1">
<p>
There's no production chain, makefiles or other authoring tools. 
</p>

<p>
No new Elisp either.
</p>

<div class="NOTES">
<p>
You're welcome to suggest improvements. But I'm not an Elisp hacker,
so I may not be able to maintain them. At the moment, the intent is to
rely on the original org-reveal only, as much as possible.
</p>

</div>
</div>
</div>

<div id="outline-container-orgb9a90d2" class="outline-3">
<h3 id="orgb9a90d2"><span class="section-number-3">5.2</span> Modify only the lesson.org</h3>
<div class="outline-text-3" id="text-5-2">
<p>
<b>Only one file should be edited for writing the lesson's material : <code>lesson.org</code></b>
</p>

<p>
Only exception is modification of some configurations for title pages
and other bits that shouldn't change much in time (see next section).
</p>
</div>
</div>

<div id="outline-container-org3603f1e" class="outline-3">
<h3 id="org3603f1e"><span class="section-number-3">5.3</span> Configuration</h3>
<div class="outline-text-3" id="text-5-3">
<p>
Each lesson.org needs some configuration :
</p>
<ul class="org-ul">
<li>Configure <code>org-reveal-title-slide</code> in <code>slides.org</code>.</li>

<li>Configure header (<code>\lhead{...}</code> and <code>\rhead{...}</code>) and footer
(<code>\lfoot{...}</code> and <code>\rfoot{...}</code>) elements in the headers like
<code>#+LaTeX_HEADER: \rhead{...}</code> in <code>handbook.org</code> and
<code>teacher-handbook.org</code>.</li>
</ul>

<div class="NOTES">
<p>
These may be better handled, but some limitations of the exporters or
my lack of knowledge/time have prevented a better result so
far. Improvements much welcome.
</p>

</div>
</div>
</div>
