lesson.org
** Generating final documents

We're using the standard exporters so each output format will be exported from its corresponding umbrella =.org= source :

#+REVEAL: split

- slides :: open =slides.org=, then =C-c C-e R ...= for =org-reveal= export (to =slides.html=), provided that you have loaded org-reveal in Emacs
- handbook :: open =handbook.org=, then =C-c C-e l ...= for LaTeX export (to =handbook.pdf=)
- teacher handbook :: open =teacher-handbook.org=, then =C-c C-e l ...= for LaTeX export (to =teacher-handbook.pdf=)

*** Exporting slides to HTML with org-reveal

Depending on how you installed org-reveal ([[*Git submodules][Git submodules]] or otherwise), =org-reveal= may already be available.

If not yet, load it with =M-x load-file= from the location of its Git submodule (=elisp/org-reveal/ox-reveal.el= by default).

#+BEGIN_NOTES
I'm not sure which solution is better : org-reveal from Git (hence the Git submodule) or from an Emacs package. Please report.
#+END_NOTES

*** Printing slides

I've tested [[https://github.com/astefanutti/decktape][DeckTape]] using a Docker container containing =PhantomJS= and
=decktape= to convert the slides to a [[file:slides.pdf][single PDF document]].

See the provided [[file:bin/decktape.sh][decktape.sh]] script that runs the container, bind-mounting the
working dir into the container, so that input and output files can be
found.

Note that I used a rebuilt Docker image, reusing the [[https://raw.githubusercontent.com/astefanutti/decktape/master/Dockerfile][DeckTape
Dockerfile]], rebuilding with something alongside:
#+BEGIN_SRC sh
docker build -t obergixlocal/decktape .
#+END_SRC

** Known Issues

*** Firefox issues ?

We have experienced issues with presentations made on some versions of Firefox, which are known by reveal.js maintainer... maybe best viewed in chrome.

You may prefer to have a PDF variant of the slides (see [[*Printing slides][Printing slides]]) in case.



* How it works / Installation
:PROPERTIES:
:REVEAL_EXTRA_ATTR: class="center"
:reveal_background: #dbdbed
:END:

** Use the source Luke

See the contents of the files... but be wary that it's sometimes messy and incrementally obtained.

Emacs is your buddy.

Git clone from =https://gitlab.com/olberger/org-teaching.git= (see the [[https://gitlab.com/olberger/org-teaching][Gitlab project]])

** TODO Use docker

You may use the docker container I've prepared, to make org-mode
exports. Or you may rebuild it yourself.

*** Build the Docker container image

#+BEGIN_SRC sh
cd docker
docker build -t obergixlocal/docker-org-export .
#+END_SRC

*** Run the container

Use the provided =docker/docker-org-export= script. See how [[file:Makefile]] does it.

** Git submodules

The repository contains Git submodules for :
- =reveal.js/=
- =elisp/org-reveal=
- reveal.js's jump plugin (=reveal.js-jump-plugin/=)

So :
#+BEGIN_SRC sh
git submodule init
git submodule update
#+END_SRC
You may prefer to install them another way (ELPA repo, CDN, etc.)

#+BEGIN_NOTES
Refer to [[https://github.com/yjwen/org-reveal/#requirements-and-installation][org-reveal's documentation]] for more details.
#+END_NOTES

** Slides appearance

*** Reveal.js settings

See the org-reveal settings set in the sources and the docs for a detailed explanation.

I'm using the following for a "frugal" look close to what
powerpoint or beamer (?) could look like :

#+BEGIN_SRC org
  ,#+REVEAL_HLEVEL: 2
  ,#+REVEAL_THEME: simple
  ,#+REVEAL_TRANS: fade
  ,#+REVEAL_SPEED: fast
  ,#+REVEAL_MARGIN: 0.0
  ,#+REVEAL_EXTRA_CSS: ./presentation.css
  ,#+REVEAL_ROOT: ./reveal.js

  ,#+OPTIONS: reveal_center:nil 
#+END_SRC

*** Section separators

The highest level sections include the following properties below the heading line, to customize the look of the slide. 

#+BEGIN_SRC org
:PROPERTIES:
:REVEAL_EXTRA_ATTR: class="center"
:reveal_background: #dbdbed
:END:
#+END_SRC

This is intended to provide some visual sense of the transitions between sections. Please adapt and report.

*** Title screen picture (logos, etc.)

I'm not yet sure how much may be achieved with HTML and CSS for the
title page of the slides deck, so I've relied on the embedding of a
background image that will contain the logos and additional graphics. 

#+BEGIN_SRC org
  ,#+REVEAL_TITLE_SLIDE_BACKGROUND: ./media/title-slide-background.png
#+END_SRC

I'm quite sure this could be improved.


* Annex                                                       

** Thanks

- All contributors to org-mode (special kudos to Carsten Dominik and Bastien Guerry)
- Yujie Wen for =org-reveal=
- Hakim El Hattab for =reveal.js=
- My colleagues at Telecom SudParis who had to teach with this tool without much rehersal
- Our students who endured it for a brand new course (and included bugs)

** Feedback

I may be contacted from [[http://www-public.tem-tsp.eu/~berger_o/#sec-3][my Web page]] or via [[https://gitlab.com/olberger/org-teaching][the Gitlab project]].

** Usage reports :handbookonly:

*** 2016-2018 at Telecom SudParis

Created and used for 2 editions of teaching "Web Architecture and Applications" in the CSC4101 module at Telecom SudParis (Olivier Berger and colleagues)

* COMMENT TODO


* COMMENT Footer 

# Local Variables:
# org-image-actual-width: nil
# End:
