lesson.html

<div id="outline-container-orga8c3f88" class="outline-3">
<h3 id="orga8c3f88"><span class="section-number-3">5.4</span> Generating final documents</h3>
<div class="outline-text-3" id="text-5-4">
<p>
We're using the standard exporters so each output format will be exported from its corresponding umbrella <code>.org</code> source :
</p>

<dl class="org-dl">
<dt>slides</dt><dd>open <code>slides.org</code>, then <code>C-c C-e R ...</code> for <code>org-reveal</code> export (to <code>slides.html</code>), provided that you have loaded org-reveal in Emacs</dd>
<dt>handbook</dt><dd>open <code>handbook.org</code>, then <code>C-c C-e l ...</code> for LaTeX export (to <code>handbook.pdf</code>)</dd>
<dt>teacher handbook</dt><dd>open <code>teacher-handbook.org</code>, then <code>C-c C-e l ...</code> for LaTeX export (to <code>teacher-handbook.pdf</code>)</dd>
</dl>
</div>

<div id="outline-container-orgb420c55" class="outline-4">
<h4 id="orgb420c55"><span class="section-number-4">5.4.1</span> Exporting slides to HTML with org-reveal</h4>
<div class="outline-text-4" id="text-5-4-1">
<p>
Depending on how you installed org-reveal (<a href="#orga11e691">Git submodules</a> or otherwise), <code>org-reveal</code> may already be available.
</p>

<p>
If not yet, load it with <code>M-x load-file</code> from the location of its Git submodule (<code>elisp/org-reveal/ox-reveal.el</code> by default).
</p>

<div class="NOTES">
<p>
I'm not sure which solution is better : org-reveal from Git (hence the Git submodule) or from an Emacs package. Please report.
</p>

</div>
</div>
</div>

<div id="outline-container-orgfd16198" class="outline-4">
<h4 id="orgfd16198"><span class="section-number-4">5.4.2</span> Printing slides</h4>
<div class="outline-text-4" id="text-5-4-2">
<p>
I've tested <a href="https://github.com/astefanutti/decktape">DeckTape</a> using a Docker container containing <code>PhantomJS</code> and
<code>decktape</code> to convert the slides to a <a href="slides.pdf">single PDF document</a>.
</p>

<p>
See the provided <a href="bin/decktape.sh">decktape.sh</a> script that runs the container, bind-mounting the
working dir into the container, so that input and output files can be
found.
</p>

<p>
Note that I used a rebuilt Docker image, reusing the <a href="https://raw.githubusercontent.com/astefanutti/decktape/master/Dockerfile">DeckTape
Dockerfile</a>, rebuilding with something alongside:
</p>
<div class="org-src-container">
<pre class="src src-sh">docker build -t obergixlocal/decktape .
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org3317770" class="outline-3">
<h3 id="org3317770"><span class="section-number-3">5.5</span> Known Issues</h3>
<div class="outline-text-3" id="text-5-5">
</div><div id="outline-container-org80c5570" class="outline-4">
<h4 id="org80c5570"><span class="section-number-4">5.5.1</span> Firefox issues ?</h4>
<div class="outline-text-4" id="text-5-5-1">
<p>
We have experienced issues with presentations made on some versions of Firefox, which are known by reveal.js maintainer&#x2026; maybe best viewed in chrome.
</p>

<p>
You may prefer to have a PDF variant of the slides (see <a href="#orgfd16198">Printing slides</a>) in case.
</p>
</div>
</div>
</div>
</div>



<div id="outline-container-org2e868dd" class="outline-2">
<h2 id="org2e868dd"><span class="section-number-2">6</span> How it works / Installation</h2>
<div class="outline-text-2" id="text-6">
</div>

<div id="outline-container-org8da4a66" class="outline-3">
<h3 id="org8da4a66"><span class="section-number-3">6.1</span> Use the source Luke</h3>
<div class="outline-text-3" id="text-6-1">
<p>
See the contents of the files&#x2026; but be wary that it's sometimes messy and incrementally obtained.
</p>

<p>
Emacs is your buddy.
</p>

<p>
Git clone from <code>https://gitlab.com/olberger/org-teaching.git</code> (see the <a href="https://gitlab.com/olberger/org-teaching">Gitlab project</a>)
</p>
</div>
</div>

<div id="outline-container-orga11e691" class="outline-3">
<h3 id="orga11e691"><span class="section-number-3">6.2</span> Git submodules</h3>
<div class="outline-text-3" id="text-6-2">
<p>
The repository contains Git submodules for :
</p>
<ul class="org-ul">
<li>reveal.js</li>
<li>org-reveal</li>
</ul>

<p>
So :
</p>
<div class="org-src-container">
<pre class="src src-sh">git submodule init
git submodule update
</pre>
</div>
<p>
You may prefer to install them another way (ELPA repo, CDN, etc.)
</p>

<div class="NOTES">
<p>
Refer to <a href="https://github.com/yjwen/org-reveal/#requirements-and-installation">org-reveal's documentation</a> for more details.
</p>

</div>
</div>
</div>

<div id="outline-container-org8f28f62" class="outline-3">
<h3 id="org8f28f62"><span class="section-number-3">6.3</span> Slides appearance</h3>
<div class="outline-text-3" id="text-6-3">
</div><div id="outline-container-org1d57a49" class="outline-4">
<h4 id="org1d57a49"><span class="section-number-4">6.3.1</span> Reveal.js settings</h4>
<div class="outline-text-4" id="text-6-3-1">
<p>
See the org-reveal settings set in the sources and the docs for a detailed explanation.
</p>

<p>
I'm using the following for a "frugal" look close to what
powerpoint or beamer (?) could look like :
</p>

<div class="org-src-container">
<pre class="src src-org"><span style="color: #b22222;">#+REVEAL_HLEVEL: 2</span>
<span style="color: #b22222;">#+REVEAL_THEME: simple</span>
<span style="color: #b22222;">#+REVEAL_TRANS: fade</span>
<span style="color: #b22222;">#+REVEAL_SPEED: fast</span>
<span style="color: #b22222;">#+REVEAL_MARGIN: 0.0</span>
<span style="color: #b22222;">#+REVEAL_EXTRA_CSS: ./presentation.css</span>
<span style="color: #b22222;">#+REVEAL_ROOT: ./reveal.js</span>

<span style="color: #b22222;">#+OPTIONS: reveal_center:nil</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org55c05ff" class="outline-4">
<h4 id="org55c05ff"><span class="section-number-4">6.3.2</span> Section separators</h4>
<div class="outline-text-4" id="text-6-3-2">
<p>
The highest level sections include the following properties below the heading line, to customize the look of the slide. 
</p>

<div class="org-src-container">
<pre class="src src-org"><span style="color: #a020f0;">:PROPERTIES:</span>
<span style="color: #a020f0;">:REVEAL_EXTRA_ATTR:</span> class="center"
<span style="color: #a020f0;">:reveal_background:</span> #dbdbed
<span style="color: #a020f0;">:END:</span>
</pre>
</div>

<p>
This is intended to provide some visual sense of the transitions between sections. Please adapt and report.
</p>
</div>
</div>

<div id="outline-container-org0ba5c0b" class="outline-4">
<h4 id="org0ba5c0b"><span class="section-number-4">6.3.3</span> Title screen picture (logos, etc.)</h4>
<div class="outline-text-4" id="text-6-3-3">
<p>
I'm not yet sure how much may be achieved with HTML and CSS for the
title page of the slides deck, so I've relied on the embedding of a
background image that will contain the logos and additional graphics. 
</p>

<div class="org-src-container">
<pre class="src src-org"><span style="color: #b22222;">#+REVEAL_TITLE_SLIDE_BACKGROUND: ./media/title-slide-background.png</span>
</pre>
</div>

<p>
I'm quite sure this could be improved.
</p>
</div>
</div>
</div>
</div>


<div id="outline-container-org52b77c7" class="outline-2">
<h2 id="org52b77c7"><span class="section-number-2">7</span> Annex</h2>
<div class="outline-text-2" id="text-7">
</div><div id="outline-container-org5ae2323" class="outline-3">
<h3 id="org5ae2323"><span class="section-number-3">7.1</span> Thanks</h3>
<div class="outline-text-3" id="text-7-1">
<ul class="org-ul">
<li>All contributors to org-mode (special kudos to Carsten Dominik and Bastien Guerry)</li>
<li>Yujie Wen for <code>org-reveal</code></li>
<li>Hakim El Hattab for <code>reveal.js</code></li>
<li>My colleagues at Telecom SudParis who had to teach with this tool without much rehersal</li>
<li>Our students who endured it for a brand new course (and included bugs)</li>
</ul>
</div>
</div>

<div id="outline-container-orge84a414" class="outline-3">
<h3 id="orge84a414"><span class="section-number-3">7.2</span> Feedback</h3>
<div class="outline-text-3" id="text-7-2">
<p>
I may be contacted from <a href="http://www-public.tem-tsp.eu/~berger_o/#sec-3">my Web page</a> or via <a href="https://gitlab.com/olberger/org-teaching">the Gitlab project</a>.
</p>
</div>
</div>

<div id="outline-container-org14326fd" class="outline-3">
<h3 id="org14326fd"><span class="section-number-3">7.3</span> Usage reports</h3>
<div class="outline-text-3" id="text-7-3">
</div><div id="outline-container-org3a41846" class="outline-4">
<h4 id="org3a41846"><span class="section-number-4">7.3.1</span> 2016 at Telecom SudParis</h4>
<div class="outline-text-4" id="text-7-3-1">
<p>
Created and used for the first time for teaching "Web Architecture and Applications" in the CSC4101 module at Telecom SudParis (Olivier Berger and colleagues)
</p>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2017-05-18</p>
<p class="author">Author: Olivier Berger</p>
<p class="date">Created: 2017-05-18 jeu. 16:47</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
